Silvxo/Upsensor_Boards/Upsensor_Boards/boards.txt

UPSENSOR.name=UPSENSOR BOARDS

UPSENSOR.bootloader.tool=esptool_py
UPSENSOR.bootloader.tool.default=esptool_py

UPSENSOR.upload.tool=esptool_py
UPSENSOR.upload.tool.default=esptool_py
UPSENSOR.upload.tool.network=esp_ota

UPSENSOR.upload.maximum_size=1310720
UPSENSOR.upload.maximum_data_size=327680
UPSENSOR.upload.flags=
UPSENSOR.upload.extra_flags=

UPSENSOR.serial.disableDTR=true
UPSENSOR.serial.disableRTS=true

UPSENSOR.build.tarch=xtensa
UPSENSOR.build.bootloader_addr=0x1000
UPSENSOR.build.target=esp32
UPSENSOR.build.mcu=esp32
UPSENSOR.build.core=esp32
UPSENSOR.build.variant=UPSENSOR
UPSENSOR.build.board=UPSENSOR

UPSENSOR.build.f_cpu=240000000L
UPSENSOR.build.flash_size=4MB
UPSENSOR.build.flash_freq=40m
UPSENSOR.build.flash_mode=dio
UPSENSOR.build.boot=dio
UPSENSOR.build.partitions=default
UPSENSOR.build.defines=
UPSENSOR.build.loop_core=
UPSENSOR.build.event_core=

UPSENSOR.menu.PSRAM.disabled=Disabled
UPSENSOR.menu.PSRAM.disabled.build.defines=
UPSENSOR.menu.PSRAM.disabled.build.extra_libs=
UPSENSOR.menu.PSRAM.enabled=Enabled
UPSENSOR.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
UPSENSOR.menu.PSRAM.enabled.build.extra_libs=

UPSENSOR.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
UPSENSOR.menu.PartitionScheme.default.build.partitions=default
UPSENSOR.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
UPSENSOR.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
UPSENSOR.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
UPSENSOR.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
UPSENSOR.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
UPSENSOR.menu.PartitionScheme.default_16MB=Default (6.25MB APP/3.43MB SPIFFS)
UPSENSOR.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
UPSENSOR.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
UPSENSOR.menu.PartitionScheme.upsensor_16MB=UPSENSOR_CUSTOM_16MB (4MB APP/8MB SPIFFS)
UPSENSOR.menu.PartitionScheme.upsensor_16MB.build.partitions=upsensor_16MB
UPSENSOR.menu.PartitionScheme.upsensor_16MB.upload.maximum_size=6553600
UPSENSOR.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
UPSENSOR.menu.PartitionScheme.minimal.build.partitions=minimal
UPSENSOR.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
UPSENSOR.menu.PartitionScheme.no_ota.build.partitions=no_ota
UPSENSOR.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
UPSENSOR.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
UPSENSOR.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
UPSENSOR.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
UPSENSOR.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
UPSENSOR.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
UPSENSOR.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
UPSENSOR.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
UPSENSOR.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
UPSENSOR.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
UPSENSOR.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
UPSENSOR.menu.PartitionScheme.huge_app.build.partitions=huge_app
UPSENSOR.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
UPSENSOR.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
UPSENSOR.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
UPSENSOR.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
UPSENSOR.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
UPSENSOR.menu.PartitionScheme.fatflash.build.partitions=ffat
UPSENSOR.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
UPSENSOR.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
UPSENSOR.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
UPSENSOR.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
UPSENSOR.menu.PartitionScheme.rainmaker=RainMaker
UPSENSOR.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
UPSENSOR.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

UPSENSOR.menu.CPUFreq.240=240MHz (WiFi/BT)
UPSENSOR.menu.CPUFreq.240.build.f_cpu=240000000L
UPSENSOR.menu.CPUFreq.160=160MHz (WiFi/BT)
UPSENSOR.menu.CPUFreq.160.build.f_cpu=160000000L
UPSENSOR.menu.CPUFreq.80=80MHz (WiFi/BT)
UPSENSOR.menu.CPUFreq.80.build.f_cpu=80000000L
UPSENSOR.menu.CPUFreq.40=40MHz (40MHz XTAL)
UPSENSOR.menu.CPUFreq.40.build.f_cpu=40000000L
UPSENSOR.menu.CPUFreq.26=26MHz (26MHz XTAL)
UPSENSOR.menu.CPUFreq.26.build.f_cpu=26000000L
UPSENSOR.menu.CPUFreq.20=20MHz (40MHz XTAL)
UPSENSOR.menu.CPUFreq.20.build.f_cpu=20000000L
UPSENSOR.menu.CPUFreq.13=13MHz (26MHz XTAL)
UPSENSOR.menu.CPUFreq.13.build.f_cpu=13000000L
UPSENSOR.menu.CPUFreq.10=10MHz (40MHz XTAL)
UPSENSOR.menu.CPUFreq.10.build.f_cpu=10000000L

UPSENSOR.menu.FlashMode.qio=QIO
UPSENSOR.menu.FlashMode.qio.build.flash_mode=dio
UPSENSOR.menu.FlashMode.qio.build.boot=qio
UPSENSOR.menu.FlashMode.dio=DIO
UPSENSOR.menu.FlashMode.dio.build.flash_mode=dio
UPSENSOR.menu.FlashMode.dio.build.boot=dio
UPSENSOR.menu.FlashMode.qout=QOUT
UPSENSOR.menu.FlashMode.qout.build.flash_mode=dout
UPSENSOR.menu.FlashMode.qout.build.boot=qout
UPSENSOR.menu.FlashMode.dout=DOUT
UPSENSOR.menu.FlashMode.dout.build.flash_mode=dout
UPSENSOR.menu.FlashMode.dout.build.boot=dout

UPSENSOR.menu.FlashFreq.80=80MHz
UPSENSOR.menu.FlashFreq.80.build.flash_freq=80m
UPSENSOR.menu.FlashFreq.40=40MHz
UPSENSOR.menu.FlashFreq.40.build.flash_freq=40m

UPSENSOR.menu.FlashSize.4M=4MB (32Mb)
UPSENSOR.menu.FlashSize.4M.build.flash_size=4MB
UPSENSOR.menu.FlashSize.8M=8MB (64Mb)
UPSENSOR.menu.FlashSize.8M.build.flash_size=8MB
UPSENSOR.menu.FlashSize.8M.build.partitions=default_8MB
UPSENSOR.menu.FlashSize.2M=2MB (16Mb)
UPSENSOR.menu.FlashSize.2M.build.flash_size=2MB
UPSENSOR.menu.FlashSize.2M.build.partitions=minimal
UPSENSOR.menu.FlashSize.16M=16MB (128Mb)
UPSENSOR.menu.FlashSize.16M.build.flash_size=16MB

UPSENSOR.menu.UploadSpeed.921600=921600
UPSENSOR.menu.UploadSpeed.921600.upload.speed=921600
UPSENSOR.menu.UploadSpeed.115200=115200
UPSENSOR.menu.UploadSpeed.115200.upload.speed=115200
UPSENSOR.menu.UploadSpeed.256000.windows=256000
UPSENSOR.menu.UploadSpeed.256000.upload.speed=256000
UPSENSOR.menu.UploadSpeed.230400.windows.upload.speed=256000
UPSENSOR.menu.UploadSpeed.230400=230400
UPSENSOR.menu.UploadSpeed.230400.upload.speed=230400
UPSENSOR.menu.UploadSpeed.460800.linux=460800
UPSENSOR.menu.UploadSpeed.460800.macosx=460800
UPSENSOR.menu.UploadSpeed.460800.upload.speed=460800
UPSENSOR.menu.UploadSpeed.512000.windows=512000
UPSENSOR.menu.UploadSpeed.512000.upload.speed=512000

UPSENSOR.menu.LoopCore.1=Core 1
UPSENSOR.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
UPSENSOR.menu.LoopCore.0=Core 0
UPSENSOR.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

UPSENSOR.menu.EventsCore.1=Core 1
UPSENSOR.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
UPSENSOR.menu.EventsCore.0=Core 0
UPSENSOR.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

UPSENSOR.menu.DebugLevel.none=None
UPSENSOR.menu.DebugLevel.none.build.code_debug=0
UPSENSOR.menu.DebugLevel.error=Error
UPSENSOR.menu.DebugLevel.error.build.code_debug=1
UPSENSOR.menu.DebugLevel.warn=Warn
UPSENSOR.menu.DebugLevel.warn.build.code_debug=2
UPSENSOR.menu.DebugLevel.info=Info
UPSENSOR.menu.DebugLevel.info.build.code_debug=3
UPSENSOR.menu.DebugLevel.debug=Debug
UPSENSOR.menu.DebugLevel.debug.build.code_debug=4
UPSENSOR.menu.DebugLevel.verbose=Verbose
UPSENSOR.menu.DebugLevel.verbose.build.code_debug=5

UPSENSOR.menu.EraseFlash.none=Disabled
UPSENSOR.menu.EraseFlash.none.upload.erase_cmd=
UPSENSOR.menu.EraseFlash.all=Enabled
UPSENSOR.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

UPSENSOR16.name=UPSENSOR_16MB BOARDS

UPSENSOR16.bootloader.tool=esptool_py
UPSENSOR.bootloader.tool.default=esptool_py

UPSENSOR16.upload.tool=esptool_py
UPSENSOR16.upload.tool.default=esptool_py
UPSENSOR16.upload.tool.network=esp_ota

UPSENSOR16.upload.maximum_size=1310720
UPSENSOR16.upload.maximum_data_size=327680
UPSENSOR16.upload.flags=
UPSENSOR16.upload.extra_flags=

UPSENSOR16.serial.disableDTR=true
UPSENSOR16.serial.disableRTS=true

UPSENSOR16.build.tarch=xtensa
UPSENSOR16.build.bootloader_addr=0x1000
UPSENSOR16.build.target=esp32
UPSENSOR16.build.mcu=esp32
UPSENSOR16.build.core=esp32
UPSENSOR16.build.variant=UPSENSOR16
UPSENSOR16.build.board=UPSENSOR16

UPSENSOR16.build.f_cpu=240000000L
UPSENSOR16.build.flash_size=4MB
UPSENSOR16.build.flash_freq=40m
UPSENSOR16.build.flash_mode=dio
UPSENSOR16.build.boot=dio
UPSENSOR16.build.partitions=upsensor_16MB
UPSENSOR16.build.defines=
UPSENSOR16.build.loop_core=
UPSENSOR16.build.event_core=

## IDE 2.0 Seems to not update the value
UPSENSOR16.menu.JTAGAdapter.external=FTDI Adapter
UPSENSOR16.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
UPSENSOR16.menu.JTAGAdapter.bridge=ESP USB Bridge
UPSENSOR16.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg

UPSENSOR16.menu.PSRAM.disabled=Disabled
UPSENSOR16.menu.PSRAM.disabled.build.defines=
UPSENSOR16.menu.PSRAM.disabled.build.extra_libs=
UPSENSOR16.menu.PSRAM.enabled=Enabled
UPSENSOR16.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
UPSENSOR16.menu.PSRAM.enabled.build.extra_libs=

UPSENSOR16.menu.PartitionScheme.upsensor_16MB=UPSENSOR_CUSTOM_16MB (3.5+3.5MB APP/8.75MB SPIFFS)
UPSENSOR16.menu.PartitionScheme.upsensor_16MB.build.partitions=upsensor_16MB
UPSENSOR16.menu.PartitionScheme.upsensor_16MB.upload.maximum_size=6553600
UPSENSOR16.menu.PartitionScheme.default_16MB=Default 16MB (6.25MB APP/3.43MB SPIFFS)
UPSENSOR16.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
UPSENSOR16.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
UPSENSOR16.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
UPSENSOR16.menu.PartitionScheme.default.build.partitions=default
UPSENSOR16.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
UPSENSOR16.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
UPSENSOR16.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
UPSENSOR16.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
UPSENSOR16.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
UPSENSOR16.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
UPSENSOR16.menu.PartitionScheme.minimal.build.partitions=minimal
UPSENSOR16.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
UPSENSOR16.menu.PartitionScheme.no_ota.build.partitions=no_ota
UPSENSOR16.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
UPSENSOR16.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
UPSENSOR16.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
UPSENSOR16.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
UPSENSOR16.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
UPSENSOR16.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
UPSENSOR16.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
UPSENSOR16.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
UPSENSOR16.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
UPSENSOR16.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
UPSENSOR16.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
UPSENSOR16.menu.PartitionScheme.huge_app.build.partitions=huge_app
UPSENSOR16.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
UPSENSOR16.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
UPSENSOR16.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
UPSENSOR16.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
UPSENSOR16.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
UPSENSOR16.menu.PartitionScheme.fatflash.build.partitions=ffat
UPSENSOR16.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
UPSENSOR16.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
UPSENSOR16.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
UPSENSOR16.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
UPSENSOR16.menu.PartitionScheme.rainmaker=RainMaker
UPSENSOR16.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
UPSENSOR16.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

UPSENSOR16.menu.CPUFreq.240=240MHz (WiFi/BT)
UPSENSOR16.menu.CPUFreq.240.build.f_cpu=240000000L
UPSENSOR16.menu.CPUFreq.160=160MHz (WiFi/BT)
UPSENSOR16.menu.CPUFreq.160.build.f_cpu=160000000L
UPSENSOR16.menu.CPUFreq.80=80MHz (WiFi/BT)
UPSENSOR16.menu.CPUFreq.80.build.f_cpu=80000000L
UPSENSOR16.menu.CPUFreq.40=40MHz (40MHz XTAL)
UPSENSOR16.menu.CPUFreq.40.build.f_cpu=40000000L
UPSENSOR16.menu.CPUFreq.26=26MHz (26MHz XTAL)
UPSENSOR16.menu.CPUFreq.26.build.f_cpu=26000000L
UPSENSOR16.menu.CPUFreq.20=20MHz (40MHz XTAL)
UPSENSOR16.menu.CPUFreq.20.build.f_cpu=20000000L
UPSENSOR16.menu.CPUFreq.13=13MHz (26MHz XTAL)
UPSENSOR16.menu.CPUFreq.13.build.f_cpu=13000000L
UPSENSOR16.menu.CPUFreq.10=10MHz (40MHz XTAL)
UPSENSOR16.menu.CPUFreq.10.build.f_cpu=10000000L

UPSENSOR16.menu.FlashMode.qio=QIO
UPSENSOR16.menu.FlashMode.qio.build.flash_mode=dio
UPSENSOR16.menu.FlashMode.qio.build.boot=qio
UPSENSOR16.menu.FlashMode.dio=DIO
UPSENSOR16.menu.FlashMode.dio.build.flash_mode=dio
UPSENSOR16.menu.FlashMode.dio.build.boot=dio
UPSENSOR16.menu.FlashMode.qout=QOUT
UPSENSOR16.menu.FlashMode.qout.build.flash_mode=dout
UPSENSOR16.menu.FlashMode.qout.build.boot=qout
UPSENSOR16.menu.FlashMode.dout=DOUT
UPSENSOR16.menu.FlashMode.dout.build.flash_mode=dout
UPSENSOR16.menu.FlashMode.dout.build.boot=dout

UPSENSOR16.menu.FlashFreq.80=80MHz
UPSENSOR16.menu.FlashFreq.80.build.flash_freq=80m
UPSENSOR16.menu.FlashFreq.40=40MHz
UPSENSOR16.menu.FlashFreq.40.build.flash_freq=40m

UPSENSOR16.menu.FlashSize.4M=4MB (32Mb)
UPSENSOR16.menu.FlashSize.4M.build.flash_size=4MB
UPSENSOR16.menu.FlashSize.8M=8MB (64Mb)
UPSENSOR16.menu.FlashSize.8M.build.flash_size=8MB
UPSENSOR16.menu.FlashSize.8M.build.partitions=default_8MB
UPSENSOR16.menu.FlashSize.2M=2MB (16Mb)
UPSENSOR16.menu.FlashSize.2M.build.flash_size=2MB
UPSENSOR16.menu.FlashSize.2M.build.partitions=minimal
UPSENSOR16.menu.FlashSize.16M=16MB (128Mb)
UPSENSOR16.menu.FlashSize.16M.build.flash_size=16MB

UPSENSOR16.menu.UploadSpeed.921600=921600
UPSENSOR16.menu.UploadSpeed.921600.upload.speed=921600
UPSENSOR16.menu.UploadSpeed.115200=115200
UPSENSOR16.menu.UploadSpeed.115200.upload.speed=115200
UPSENSOR16.menu.UploadSpeed.256000.windows=256000
UPSENSOR16.menu.UploadSpeed.256000.upload.speed=256000
UPSENSOR16.menu.UploadSpeed.230400.windows.upload.speed=256000
UPSENSOR16.menu.UploadSpeed.230400=230400
UPSENSOR16.menu.UploadSpeed.230400.upload.speed=230400
UPSENSOR16.menu.UploadSpeed.460800.linux=460800
UPSENSOR16.menu.UploadSpeed.460800.macosx=460800
UPSENSOR16.menu.UploadSpeed.460800.upload.speed=460800
UPSENSOR16.menu.UploadSpeed.512000.windows=512000
UPSENSOR16.menu.UploadSpeed.512000.upload.speed=512000

UPSENSOR16.menu.LoopCore.1=Core 1
UPSENSOR16.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
UPSENSOR16.menu.LoopCore.0=Core 0
UPSENSOR16.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

UPSENSOR16.menu.EventsCore.1=Core 1
UPSENSOR16.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
UPSENSOR16.menu.EventsCore.0=Core 0
UPSENSOR16.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

UPSENSOR16.menu.DebugLevel.none=None
UPSENSOR16.menu.DebugLevel.none.build.code_debug=0
UPSENSOR16.menu.DebugLevel.error=Error
UPSENSOR16.menu.DebugLevel.error.build.code_debug=1
UPSENSOR16.menu.DebugLevel.warn=Warn
UPSENSOR16.menu.DebugLevel.warn.build.code_debug=2
UPSENSOR16.menu.DebugLevel.info=Info
UPSENSOR16.menu.DebugLevel.info.build.code_debug=3
UPSENSOR16.menu.DebugLevel.debug=Debug
UPSENSOR16.menu.DebugLevel.debug.build.code_debug=4
UPSENSOR16.menu.DebugLevel.verbose=Verbose
UPSENSOR16.menu.DebugLevel.verbose.build.code_debug=5

UPSENSOR16.menu.EraseFlash.none=Disabled
UPSENSOR16.menu.EraseFlash.none.upload.erase_cmd=
UPSENSOR16.menu.EraseFlash.all=Enabled
UPSENSOR16.menu.EraseFlash.all.upload.erase_cmd=-e